Revit 2027 API
PointOnEdge.GetEdgeReference Method
Get a copy of the edge or curve reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetEdgeReference()
Public Function GetEdgeReference As Reference
public:
Reference^ GetEdgeReference()
member GetEdgeReference : unit -> Reference
Return Value
Reference
See Also
Reference
PointOnEdge Class
Autodesk.Revit.DB Namespace